Revit 2027 API
FamilySizeTable.GetColumnHeader Method
 Gets a column of the table at at given index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilySizeTableColumn GetColumnHeader(
	int index
)
Public Function GetColumnHeader (
	index As Integer
) As FamilySizeTableColumn
public:
FamilySizeTableColumn^ GetColumnHeader(
	int index
)
member GetColumnHeader :
        index : int -> FamilySizeTableColumn
Parameters
index Int32
 Index of the column.
Return Value
FamilySizeTableColumn
 The column at the given index.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The column index is out of range.
See Also
Reference
FamilySizeTable Class
Autodesk.Revit.DB Namespace